# list
# List არის მონაცემთა ტიპი, რომელიც საშუალებას გვაძლევს შეინახოს სხვადასხვა ტიპის ელემენტები
# List არის mutable
#  List-ში ელემენტები შეიძლება იყოს სხვადასხვა ტიპის
# Lis- ში შეგვიძლია გამოვიყენოთ indexing
my_list = [1, 2, 3, 4, 5]
my_list.append(6)  
my_list.remove(10) 
list = my_list[1:3]

# tuple
# Tuple ასევე არის მონაცემთა ტიპი, რომელიც საშუალებას გვაძლევს შევინახოთ რამდენიმე ელემენტი
#  Tuple არის immutable რაც ნიშნავს იმას,რომ მასში ცვლილებებს ვერ მოვახდენთ.თუ შეიქმნა დარჩება იგივე
my_tuple = (1, 2, 3, 4, 5)
tuple = my_tuple[1:3] 
count = my_tuple.count(1) 

# SET
my_set = {1, 2, 3, 4, 5}
my_set.add(6) 
my_set.remove(3)  

# List-შექმნილია იმისთვის, რომ შევინახოთ ელემენტები, რომელთა  შეცვლა შესაძლებელი იქნება
# Tuple-შექმნილია იმისთვის, რომ შევინახოთ ელემენტები, რომლებსაც ვერ შევცვლით
# Set-შექმნილია იმისთის, რომ შევინახო უნიკალური ელემენტები, რომლებიც არ განმეორდება







