# 1.list
#  List არის მონაცემთა ტიპი, რომელიც საშუალებას გვაძლევს შეინახოს სხვადასხვა ტიპის ელემენტები
# List არის mutable
#  List-ში ელემენტები შეიძლება იყოს სხვადასხვა ტიპის
# Lis- ში შეგვიძლია გამოვიყენოთ indexing

# 2.tuple
# Tuple ასევე არის მონაცემთა ტიპი, რომელიც საშუალებას გვაძლევს შევინახოთ რამდენიმე ელემენტი
#  Tuple არის immutable რაც ნიშნავს იმას,რომ მასში ცვლილებებს ვერ მოვახდენთ.თუ შეიქმნა დარჩება იგივე

# 3.difference and like between list and tuple
# List არის mutable, ხოლო Tuple არის immutable.
# ორივე მონაცემთა ტიპი შეიძლება შეიცავდეს სხვადასხვა ტიპის ელემენტებს
# list-ში შგვიძლია ცვლილებების მოხდენა,ხოლო tuple- ში არა



set = {1, 2, 3}
set.add(4)
print(set)  

set = {1, 2, 3}
set.remove(2)
print(set) 





